benchmarks/cospec_benchmark_results_20250527_181201_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_consolidated_selective_threshold_tile_0.3_32_7_0.6_10_math500_output.txt
INFO 05-27 20:28:12 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.6, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.6
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     2578      
Benchmark duration (s):                  300.31    
Total input tokens:                      185183    
Total generated tokens:                  556030    
Request throughput (req/s):              8.58      
Output token throughput (tok/s):         1851.55   
Total Token throughput (tok/s):          2468.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          5182.87   
Median TTFT (ms):                        4335.31   
P99 TTFT (ms):                           17314.46  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          102.49    
Median TPOT (ms):                        97.88     
P99 TPOT (ms):                           216.91    
---------------Inter-token Latency----------------
Mean ITL (ms):                           234.56    
Median ITL (ms):                         213.67    
P99 ITL (ms):                            614.94    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24848.59  
Median E2EL (ms):                        21940.32  
P99 E2EL (ms):                           76302.54  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 144.54    
Median Token Latency (ms):               130.45    
P99 Token Latency (ms):                  395.55    
==================================================